
#+LINK: mmap file:~/code/platform/mmap/

**** Perf Stats - Seq Keys
     | Stats name            |    Baseline |   Optimized |       Delta |   err % |
     |-----------------------+-------------+-------------+-------------+---------|
     | L1-dcache-loads       | 18866826729 | 16869679054 | -1997147675 |  -11.84 |
     | L1-dcache-load-misses |   333005999 |   326130644 |    -6875355 |   -2.11 |
     | L1-dcache-stores      | 12665829421 | 11482519158 | -1183310263 |  -10.31 |
     | L1-dcache-stores      | 12648877431 | 11548985431 | -1099892000 |   -9.52 |
     | L1-dcache-prefetches  |    97113005 |    94673731 |    -2439274 |   -2.58 |
     | L1-dcache-prefetches  |    90528626 |    88136368 |    -2392258 |   -2.71 |
     | LLC-loads             |   466611777 |   515765854 |    49154077 |    9.53 |
     | LLC-load-misses       |   402711043 |   454473481 |    51762438 |   11.39 |
     | LLC-store-misses      |   120594807 |    96836214 |   -23758593 |  -24.53 |
     | LLC-prefetch-misses   |   247017749 |   238665910 |    -8351839 |   -3.50 |
     | dTLB-load-misses      |     8962260 |     7311250 |    -1651010 |  -22.58 |
     | dTLB-store-misses     |      259976 |       53782 |     -206194 | -383.39 |
     | iTLB-load-misses      |     1099901 |      667885 |     -432016 |  -64.68 |
     | branches              | 11536513221 |  9788891453 | -1747621768 |  -17.85 |
     | LLC-loads             |   461678069 |   519865890 |    58187821 |   11.19 |
     | LLC-stores            |   130405716 |   100801618 |   -29604098 |  -29.37 |
     | LLC-prefetches        |   616594220 |   609862393 |    -6731827 |   -1.10 |
     | dTLB-loads            | 18907201207 | 16867435071 | -2039766136 |  -12.09 |
     | dTLB-stores           | 12632128260 | 11371665835 | -1260462425 |  -11.08 |
     | iTLB-loads            | 65172671557 | 57882013441 | -7290658116 |  -12.60 |
     | cache-references      |   620823498 |   608319850 |   -12503648 |   -2.06 |
     | cache-misses          |   248399570 |   237760282 |   -10639288 |   -4.47 |
     | branch-misses         |   164717690 |   142722758 |   -21994932 |  -15.41 |
     #+TBLFM:$4=$3-$2;::$5=($4/$3)*100;%.2f
